# SQLite Datatypes
- TEXT
- INTEGER
- REAL (double precision / 15 chars long)
- BLOB

# DB Connection / Run SQL

In [18]:
import sqlite3
import pandas as pd
connection = sqlite3.connect('pet_database.db')
cursor = connection.cursor()
#cursor.execute('''
#    CREATE TABLE cats (
#        id INTEGER PRIMARY KEY,
#        name TEXT,
#        age INTEGER
#    );
#    ''')
display(cursor.execute('''SELECT * FROM sqlite_master WHERE type='table';''').fetchall())
# cursor.execute('''ALTER TABLE cats ADD COLUMN breed TEXT;''')
# cursor.execute('''ALTER TABLE cats ADD COLUMN owner_id INTEGER;''')
# cursor.execute('''DROP TABLE cats;'''

cursor.execute('''DELETE FROM cats;''')

# CRUD
cursor.execute('''INSERT INTO cats (name, age, breed, owner_id) VALUES ('Maru', 3, 'Scottish Fold', 1);''')
cursor.execute('''INSERT INTO cats (name, age, breed, owner_id) VALUES (NULL, NULL, "Tabby", NULL);''')

file = open('01_insert_cats_into_cats_table.sql', 'r')
sql = file.read()
cursor.executescript(sql)
file.close()

cursor.execute('''UPDATE cats SET name = "Hana" WHERE name = "Hannah";''')

display(cursor.execute('''SELECT name FROM cats WHERE age IS NOT NULL;''').fetchall())

# display in dataframe
def sql_select_to_df(SQL_COMMAND, cur=cursor):
    results = cur.execute(SQL_COMMAND).fetchall() # .fetchone()
    df = pd.DataFrame(results)
    df.columns = [i[0] for i in cur.description]
    return df
# df = sql_select_to_df('''SELECT * FROM cats WHERE name NOT IN ("Maru", "Hana") LIMIT 1;''')
df = sql_select_to_df('''SELECT * FROM cats WHERE age BETWEEN 1 AND 5;''')
display(df.head())

# COUNT, GROUP BY
display(cursor.execute('''SELECT cats.breed, owner_id, COUNT(breed) FROM cats GROUP BY breed, owner_id;''').fetchall())

connection.close()

[('table',
  'cats',
  'cats',
  2,
  'CREATE TABLE cats (\n        id INTEGER PRIMARY KEY,\n        name TEXT,\n        age INTEGER\n    , breed TEXT, owner_id INTEGER)')]

[('Maru',), ("Lil\\' Bub",), ('Hana',)]

   id       name  age               breed  owner_id
0   1       Maru    3       Scottish Fold         1
1   3  Lil\' Bub    5  American Shorthair         2
2   4       Hana    1               Tabby         2

[('American Shorthair', 2, 1),
 ('Scottish Fold', 1, 1),
 ('Tabby', None, 1),
 ('Tabby', 2, 1)]